## Creating dataframes

## using dictionary

In [2]:
import pandas as pd

In [1]:
dic = {'Name':['Ravi','Raju','Rahul'],'Roll-No':[21,25,32]}

In [3]:
# Creating dataframe
df = pd.DataFrame(dic)

In [4]:
df

    Name  Roll-No
0   Ravi       21
1   Raju       25
2  Rahul       32

## using tuple_values

In [5]:
tup = [
    ('Ravi',21),
    ('Raju',25),
    ('Rahul',32)
]

In [6]:
df = pd.DataFrame(tup,columns=['Name','Roll-No'])

In [7]:
df

    Name  Roll-No
0   Ravi       21
1   Raju       25
2  Rahul       32

## using csv files

In [11]:
file_name = 'sample_data.csv'

In [12]:
df = pd.read_csv(file_name)

In [13]:
df

    Name  Roll-No
0   Ravi       21
1   Raju       25
2  Rahul       32

## using xlsx files

In [14]:
file_name = '//home/dolby/sample_data.xlsx'
sheet_name = 'Sheet1'

In [15]:
df = pd.read_excel(file_name,sheet_name)

In [16]:
df

    Name  Roll-No
0   Ravi       21
1   Raju       25
2  Rahul       32

In [17]:
sheet_name = 'Sheet2'

In [18]:
df = pd.read_excel(file_name,sheet_name)

In [19]:
df

   Age    Name
0   18  Naruto
1   19   Luffy
2   20  Ichigo